10/data/attachments/68d6b7005d52ed95.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a0190080-e586-4dc7-b364-b59b2cc15082</nif:username>
            <nif:friendToBeAdded>Alyssa_later_Friend_85924_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>